In [1]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, confusion_matrix, plot_confusion_matrix, classification_report
import joblib
from matplotlib import pyplot as plt
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
pf = pd.read_csv('cleaning.csv')

In [3]:
pf

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...,...
18236,18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [4]:
pf.head()

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

In [5]:
pf.describe()

         Unnamed: 0
count  18241.000000
mean    9120.000000
std     5265.867466
min        0.000000
25%     4560.000000
50%     9120.000000
75%    13680.000000
max    18240.000000

In [6]:
pf.columns

Index(['Unnamed: 0', 'City', 'Colors Reported', 'Shape Reported', 'State',
       'Time'],
      dtype='object')

In [7]:
pf.shape

(18241, 6)

In [8]:
num_features = pf.select_dtypes(include=['int64', 'float64']).columns
cat_features = pf.select_dtypes(include=['object']).columns

In [11]:
pf.isnull().sum().sort_values(ascending=False)

Colors Reported    15359
Shape Reported      2644
City                  25
Unnamed: 0             0
State                  0
Time                   0
dtype: int64

In [12]:
for i in num_features:
    print(i)
    pf[i].fillna(pf[i].median(), inplace=True)

Unnamed: 0

In [13]:
for i in cat_features:
    print(i)
    pf[i].fillna('none', inplace=True)

City
Colors Reported
Shape Reported
State
Time

In [14]:
pf.isnull().sum().sort_values(ascending=False)

Unnamed: 0         0
City               0
Colors Reported    0
Shape Reported     0
State              0
Time               0
dtype: int64

In [15]:
from sklearn.preprocessing import LabelEncoder
scale = LabelEncoder()

In [16]:
for i in cat_features:
    pf[i] = scale.fit_transform(pf[i])

In [17]:
pf.head()

   Unnamed: 0  City  Colors Reported  Shape Reported  State   Time
0           0  2737               27              25     35   8428
1           1  6304               27              18     32  10348
2           2  2563               27              19      5   4792
3           3     2               27               9     17   8429
4           4  4017               27              17     35   6798